Revit 2027 API
ParameterTypeId.IfcProjectGuid Property
 "IfcProject GUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcProjectGuid { get; }
Public Shared ReadOnly Property IfcProjectGuid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcProjectGuid {
	ForgeTypeId^ get ();
}
static member IfcProjectGuid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace